[{"title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars", "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"title": "NASA Invites Public to Share Excitement of Mars 2020 Perseverance Rover Launch", "preview": "There are lots of ways to participate in the historic event, which is targeted for July 30."}, {"title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "Naming a NASA Mars Rover Can Change Your Life", "preview": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."}, {"title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "preview": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"title": "The Man Who Wanted to Fly on Mars", "preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "}]